**Pandas Library Installation**

In [1]:
import pandas as pd
print(pd.__version__)

2.2.2

**Pandas Series**

In [2]:
vegetables=['beetroot','carrot','tomato','coconut','scarlet gourd']

In [3]:
a=pd.Series(vegetables)
a

0         beetroot
1           carrot
2           tomato
3          coconut
4    scarlet gourd
dtype: object

In [4]:
veg_series=pd.Series(vegetables,index=['purple','orange','red','white','green'])

In [93]:
veg_series

purple         beetroot
orange           carrot
red              tomato
white           coconut
green     scarlet gourd
dtype: object

In [5]:
dict1={1:"a",2:"b",1:"c"}
#since dictionary doesnot allow key duplicates the first value of key 1 that is a is replaced by c
dict1

{1: 'c', 2: 'b'}

In [6]:
veg_dict={'red':'tomato','orange':'carrot'}
veg_dict

{'red': 'tomato', 'orange': 'carrot'}

In [7]:
veg_dict_series=pd.Series(veg_dict)
veg_dict_series

red       tomato
orange    carrot
dtype: object

In [8]:
veg_dict_series['green']='kovakkai'   #Adding key-value pair

In [9]:
veg_dict_series

red         tomato
orange      carrot
green     kovakkai
dtype: object

In [10]:
veg_dict_series.drop(['orange'])    #Removing one key-value pair

red        tomato
green    kovakkai
dtype: object

In [11]:
veg_dict_series   #It won't affect original series

red         tomato
orange      carrot
green     kovakkai
dtype: object

In [12]:
veg_dict_series.drop(['orange'],inplace=True) 
#Removing one key_value pair from original series

In [13]:
veg_dict_series#Removed series printing

red        tomato
green    kovakkai
dtype: object

**Series elements can be heterogeneous & Nested too!**

In [14]:
vegs_dict={'red':['tomato','redchilli'],'green':'kovakkai'}

In [15]:
new_veg_series=pd.Series(vegs_dict)
new_veg_series

red      [tomato, redchilli]
green               kovakkai
dtype: object

In [16]:
type(new_veg_series)

pandas.core.series.Series

In [17]:
type(new_veg_series[0])

C:\Users\Devik\AppData\Local\Temp\ipykernel_3488\1682160237.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  type(new_veg_series[0])

list

In [18]:
type(new_veg_series[0][0])

C:\Users\Devik\AppData\Local\Temp\ipykernel_3488\300706422.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  type(new_veg_series[0][0])

str

In [19]:
new_veg_series[0][0]

C:\Users\Devik\AppData\Local\Temp\ipykernel_3488\2317656166.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  new_veg_series[0][0]

'tomato'

**Pandas DataFrames**

 DataFrame is a mutable, tabular data structure in Pandas that consists of rows and columns.It is a 2-dimensional labeled data structure.

**syntax**:pd.DataFrame(iterator)

In [20]:
data={'vegetables':['beetroot','carrot','tomato','kovakkai','coconut'],
      'color':['purple','orange','red','green','white'],
      'unit':['1kg','1kg','1kg','1kg','1piece'],
      'min':[15,25,53,30,'seventeen'],
      'max':[40,45,90,45,38],
     }

In [21]:
market=pd.DataFrame(data)

In [22]:
market

  vegetables   color    unit        min  max
0   beetroot  purple     1kg         15   40
1     carrot  orange     1kg         25   45
2     tomato     red     1kg         53   90
3   kovakkai   green     1kg         30   45
4    coconut   white  1piece  seventeen   38

In [23]:
market['unit']

0       1kg
1       1kg
2       1kg
3       1kg
4    1piece
Name: unit, dtype: object

In [24]:
market['min']

0           15
1           25
2           53
3           30
4    seventeen
Name: min, dtype: object

**loc[Row/index,Columnname]**

In [25]:
market

  vegetables   color    unit        min  max
0   beetroot  purple     1kg         15   40
1     carrot  orange     1kg         25   45
2     tomato     red     1kg         53   90
3   kovakkai   green     1kg         30   45
4    coconut   white  1piece  seventeen   38

In [26]:
market.loc[0,'unit']      #loc[Row index,Columnname]

'1kg'

In [27]:
market.loc[0]   #loc[] is used to access rows or columns by label or index.

vegetables    beetroot
color           purple
unit               1kg
min                 15
max                 40
Name: 0, dtype: object

In [28]:
market.loc[1]

vegetables    carrot
color         orange
unit             1kg
min               25
max               45
Name: 1, dtype: object

In [29]:
market.loc[market['max'] > 50]

  vegetables color unit min  max
2     tomato   red  1kg  53   90

In [30]:
market['max']>50

0    False
1    False
2     True
3    False
4    False
Name: max, dtype: bool

In [31]:
market['above_50']=market['max']>50
market

  vegetables   color    unit        min  max  above_50
0   beetroot  purple     1kg         15   40     False
1     carrot  orange     1kg         25   45     False
2     tomato     red     1kg         53   90      True
3   kovakkai   green     1kg         30   45     False
4    coconut   white  1piece  seventeen   38     False

**iloc[row_index,col_index]**

Syntax: DataFrame.iloc[row_index, column_index]

In [32]:
market

  vegetables   color    unit        min  max  above_50
0   beetroot  purple     1kg         15   40     False
1     carrot  orange     1kg         25   45     False
2     tomato     red     1kg         53   90      True
3   kovakkai   green     1kg         30   45     False
4    coconut   white  1piece  seventeen   38     False

In [33]:
market.iloc[0:3,0:3]      #Fetching the range

  vegetables   color unit
0   beetroot  purple  1kg
1     carrot  orange  1kg
2     tomato     red  1kg

In [34]:
market.iloc[1:3,0:2]

  vegetables   color
1     carrot  orange
2     tomato     red

In [35]:
market.iloc[0,0:3]

vegetables    beetroot
color           purple
unit               1kg
Name: 0, dtype: object

**Adding and removing**

In [36]:
market

  vegetables   color    unit        min  max  above_50
0   beetroot  purple     1kg         15   40     False
1     carrot  orange     1kg         25   45     False
2     tomato     red     1kg         53   90      True
3   kovakkai   green     1kg         30   45     False
4    coconut   white  1piece  seventeen   38     False

In [37]:
market.loc[5]={'vegetables':'Cabbage','color':'green','unit':'1piece','min':10,'max':30,'above_50':False}
market

  vegetables   color    unit        min  max  above_50
0   beetroot  purple     1kg         15   40     False
1     carrot  orange     1kg         25   45     False
2     tomato     red     1kg         53   90      True
3   kovakkai   green     1kg         30   45     False
4    coconut   white  1piece  seventeen   38     False
5    Cabbage   green  1piece         10   30     False

In [38]:
market.loc[6]={'vegetables':'Ladies Finger','color':'green','unit':'1kg','min':10,'max':35,'above_50':False}
market

      vegetables   color    unit        min  max  above_50
0       beetroot  purple     1kg         15   40     False
1         carrot  orange     1kg         25   45     False
2         tomato     red     1kg         53   90      True
3       kovakkai   green     1kg         30   45     False
4        coconut   white  1piece  seventeen   38     False
5        Cabbage   green  1piece         10   30     False
6  Ladies Finger   green     1kg         10   35     False

In [39]:
market.drop([6])

  vegetables   color    unit        min  max  above_50
0   beetroot  purple     1kg         15   40     False
1     carrot  orange     1kg         25   45     False
2     tomato     red     1kg         53   90      True
3   kovakkai   green     1kg         30   45     False
4    coconut   white  1piece  seventeen   38     False
5    Cabbage   green  1piece         10   30     False

In [40]:
market.loc[6]={'vegetables':'Ladies Finger','color':'green','unit':'1kg','min':10,'max':35,'above_50':False}
market

      vegetables   color    unit        min  max  above_50
0       beetroot  purple     1kg         15   40     False
1         carrot  orange     1kg         25   45     False
2         tomato     red     1kg         53   90      True
3       kovakkai   green     1kg         30   45     False
4        coconut   white  1piece  seventeen   38     False
5        Cabbage   green  1piece         10   30     False
6  Ladies Finger   green     1kg         10   35     False

In [41]:
market.drop([6],axis=0)

  vegetables   color    unit        min  max  above_50
0   beetroot  purple     1kg         15   40     False
1     carrot  orange     1kg         25   45     False
2     tomato     red     1kg         53   90      True
3   kovakkai   green     1kg         30   45     False
4    coconut   white  1piece  seventeen   38     False
5    Cabbage   green  1piece         10   30     False

In [42]:
market.drop('above_50',axis=1,inplace=True)   #To drop the column

In [43]:
market

      vegetables   color    unit        min  max
0       beetroot  purple     1kg         15   40
1         carrot  orange     1kg         25   45
2         tomato     red     1kg         53   90
3       kovakkai   green     1kg         30   45
4        coconut   white  1piece  seventeen   38
5        Cabbage   green  1piece         10   30
6  Ladies Finger   green     1kg         10   35

In [44]:
market   #It won't remove from original market data

      vegetables   color    unit        min  max
0       beetroot  purple     1kg         15   40
1         carrot  orange     1kg         25   45
2         tomato     red     1kg         53   90
3       kovakkai   green     1kg         30   45
4        coconut   white  1piece  seventeen   38
5        Cabbage   green  1piece         10   30
6  Ladies Finger   green     1kg         10   35

In [45]:
market.drop([6],axis=0,inplace=True)   #axis=0 affects the rows

In [46]:
market

  vegetables   color    unit        min  max
0   beetroot  purple     1kg         15   40
1     carrot  orange     1kg         25   45
2     tomato     red     1kg         53   90
3   kovakkai   green     1kg         30   45
4    coconut   white  1piece  seventeen   38
5    Cabbage   green  1piece         10   30

**Handling missing values-isna,sum,any,fillna,dropna(imp)**

In [47]:
market

  vegetables   color    unit        min  max
0   beetroot  purple     1kg         15   40
1     carrot  orange     1kg         25   45
2     tomato     red     1kg         53   90
3   kovakkai   green     1kg         30   45
4    coconut   white  1piece  seventeen   38
5    Cabbage   green  1piece         10   30

In [48]:
market.isna()   #Checking each and every values whether null or not

   vegetables  color   unit    min    max
0       False  False  False  False  False
1       False  False  False  False  False
2       False  False  False  False  False
3       False  False  False  False  False
4       False  False  False  False  False
5       False  False  False  False  False

In [49]:
market.isna().sum()    #Counting the number of null values

vegetables    0
color         0
unit          0
min           0
max           0
dtype: int64

In [50]:
import numpy as np    #To fill the null values we need numpy package

In [51]:
market

  vegetables   color    unit        min  max
0   beetroot  purple     1kg         15   40
1     carrot  orange     1kg         25   45
2     tomato     red     1kg         53   90
3   kovakkai   green     1kg         30   45
4    coconut   white  1piece  seventeen   38
5    Cabbage   green  1piece         10   30

In [52]:
market.loc[4,'min']=np.nan                 #Using np.nan we included null values

In [53]:
market

  vegetables   color    unit  min  max
0   beetroot  purple     1kg   15   40
1     carrot  orange     1kg   25   45
2     tomato     red     1kg   53   90
3   kovakkai   green     1kg   30   45
4    coconut   white  1piece  NaN   38
5    Cabbage   green  1piece   10   30

DataFrame market contains a column like 'min' with mixed types  probably because it once had a string like 'seventeen' in it (as you mentioned earlier), so pandas treats the column as object type, not numeric.  So if it type integer then we can fill null value with integer values as market.fillna(20,inplace=True)...otherwise leads to error...

In [54]:
market.fillna(False,inplace=True)#Null value is filled by False variable

In [55]:
market

  vegetables   color    unit    min  max
0   beetroot  purple     1kg     15   40
1     carrot  orange     1kg     25   45
2     tomato     red     1kg     53   90
3   kovakkai   green     1kg     30   45
4    coconut   white  1piece  False   38
5    Cabbage   green  1piece     10   30

In [56]:
market.dropna(axis=0)    #Not dropping anything because there is no null

  vegetables   color    unit    min  max
0   beetroot  purple     1kg     15   40
1     carrot  orange     1kg     25   45
2     tomato     red     1kg     53   90
3   kovakkai   green     1kg     30   45
4    coconut   white  1piece  False   38
5    Cabbage   green  1piece     10   30

**Lambda Function**

In [57]:
market['max']=market['max'].apply(lambda x:x+5)    #Lambda function applied to increase the maximum values by 5

In [58]:
market

  vegetables   color    unit    min  max
0   beetroot  purple     1kg     15   45
1     carrot  orange     1kg     25   50
2     tomato     red     1kg     53   95
3   kovakkai   green     1kg     30   50
4    coconut   white  1piece  False   43
5    Cabbage   green  1piece     10   35

**Data Aggregation and grouping**

In [59]:
market

  vegetables   color    unit    min  max
0   beetroot  purple     1kg     15   45
1     carrot  orange     1kg     25   50
2     tomato     red     1kg     53   95
3   kovakkai   green     1kg     30   50
4    coconut   white  1piece  False   43
5    Cabbage   green  1piece     10   35

In [60]:
market['max'].mean()    #To find the mean value of max column

53.0

In [61]:
market['max'].sum()   #Sum of max column values

318

In [62]:
market['max'].count()  #Count of rows in max columns...Returns the number of non-null entries.

6

In [63]:
market['max'].max()    #Maximum value of max column

95

In [64]:
market['max'].min()   #Minimum value of max column

35

In [65]:
market['max'].median()   #Returns the middle value when data is sorted...sorted values of max column: 35, 43, 45, 50, 50, 95 ..median=(45+50)/2

47.5

In [66]:
market['max'].std()       #Measures spread of values from the mean.

21.307275752662516

In [67]:
market['max'].var()    #Square of standard deviation. Shows data spread.

454.0

In [68]:
market['max'].describe()    #Gives full statistical summary for the column.

count     6.000000
mean     53.000000
std      21.307276
min      35.000000
25%      43.500000
50%      47.500000
75%      50.000000
max      95.000000
Name: max, dtype: float64

In [69]:
market

  vegetables   color    unit    min  max
0   beetroot  purple     1kg     15   45
1     carrot  orange     1kg     25   50
2     tomato     red     1kg     53   95
3   kovakkai   green     1kg     30   50
4    coconut   white  1piece  False   43
5    Cabbage   green  1piece     10   35

In [70]:
market.groupby('unit').sum()

                          vegetables                 color  min  max
unit
1kg     beetrootcarrottomatokovakkai  purpleorangeredgreen  123  240
1piece                coconutCabbage            whitegreen   10   78

In [71]:
market.groupby('vegetables').sum()

             color    unit    min  max
vegetables
Cabbage      green  1piece     10   35
beetroot    purple     1kg     15   45
carrot      orange     1kg     25   50
coconut      white  1piece  False   43
kovakkai     green     1kg     30   50
tomato         red     1kg     53   95

capital "C", and uppercase letters come before lowercase in ASCII order.

In [72]:
market.groupby('color').sum()

             vegetables       unit    min  max
color
green   kovakkaiCabbage  1kg1piece     40   85
orange           carrot        1kg     25   50
purple         beetroot        1kg     15   45
red              tomato        1kg     53   95
white           coconut     1piece  False   43

In [73]:
market.groupby('min').sum()

      vegetables   color    unit  max
min
False    coconut   white  1piece   43
10       Cabbage   green  1piece   35
15      beetroot  purple     1kg   45
25        carrot  orange     1kg   50
30      kovakkai   green     1kg   50
53        tomato     red     1kg   95

In [74]:
market.groupby('max').sum()

         vegetables        color    unit    min
max
35          Cabbage        green  1piece     10
43          coconut        white  1piece  False
45         beetroot       purple     1kg     15
50   carrotkovakkai  orangegreen  1kg1kg     55
95           tomato          red     1kg     53

In [75]:
market.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   vegetables  6 non-null      object
 1   color       6 non-null      object
 2   unit        6 non-null      object
 3   min         6 non-null      object
 4   max         6 non-null      int64
dtypes: int64(1), object(4)
memory usage: 460.0+ bytes

gives a summary of the DataFrame, including:

Number of rows and columns

Column names and data types

Non-null counts (missing data insight)

Memory usage

In [76]:
d=pd.read_csv('stu social media addict.csv')
d

,Student_ID,Age,Gender,Academic_Level,Country,Avg_Daily_Usage_Hours,Most_Used_Platform,Affects_Academic_Performance,Sleep_Hours_Per_Night,Mental_Health_Score,Relationship_Status,Conflicts_Over_Social_Media,Addicted_Score
0,1,19,Female,Undergraduate,Bangladesh,5.2,Instagram,Yes,6.5,6,In Relationship,3,8
1,2,22,Male,Graduate,India,2.1,Twitter,No,7.5,8,Single,0,3
2,3,20,Female,Undergraduate,USA,6.0,TikTok,Yes,5.0,5,Complicated,4,9
3,4,18,Male,High School,UK,3.0,YouTube,No,7.0,7,Single,1,4
4,5,21,Male,Graduate,Canada,4.5,Facebook,Yes,6.0,6,In Relationship,2,7
...,...,...,...,...,...,...,...,...,...,...,...,...,...
700,701,20,Female,Undergraduate,Italy,4.7,TikTok,No,7.2,7,In Relationship,2,5
701,702,23,Male,Graduate,Russia,6.8,Instagram,Yes,5.9,4,Single,5,9
702,703,21,Female,Undergraduate,China,5.6,WeChat,Yes,6.7,6,In Relationship,3,7
703,704,24,Male,Graduate,Japan,4.3,Twitter,No,7.5,8,Single,2,4
704,705,19,Female,Undergraduate,Poland,6.2,Facebook,Yes,6.3,5,Single,4,8

In [77]:
d.head()   #First 5 rows of the dataset

,Student_ID,Age,Gender,Academic_Level,Country,Avg_Daily_Usage_Hours,Most_Used_Platform,Affects_Academic_Performance,Sleep_Hours_Per_Night,Mental_Health_Score,Relationship_Status,Conflicts_Over_Social_Media,Addicted_Score
0,1,19,Female,Undergraduate,Bangladesh,5.2,Instagram,Yes,6.5,6,In Relationship,3,8
1,2,22,Male,Graduate,India,2.1,Twitter,No,7.5,8,Single,0,3
2,3,20,Female,Undergraduate,USA,6.0,TikTok,Yes,5.0,5,Complicated,4,9
3,4,18,Male,High School,UK,3.0,YouTube,No,7.0,7,Single,1,4
4,5,21,Male,Graduate,Canada,4.5,Facebook,Yes,6.0,6,In Relationship,2,7

In [78]:
d.tail()   #Last 5 rows of dataset

,Student_ID,Age,Gender,Academic_Level,Country,Avg_Daily_Usage_Hours,Most_Used_Platform,Affects_Academic_Performance,Sleep_Hours_Per_Night,Mental_Health_Score,Relationship_Status,Conflicts_Over_Social_Media,Addicted_Score
700,701,20,Female,Undergraduate,Italy,4.7,TikTok,No,7.2,7,In Relationship,2,5
701,702,23,Male,Graduate,Russia,6.8,Instagram,Yes,5.9,4,Single,5,9
702,703,21,Female,Undergraduate,China,5.6,WeChat,Yes,6.7,6,In Relationship,3,7
703,704,24,Male,Graduate,Japan,4.3,Twitter,No,7.5,8,Single,2,4
704,705,19,Female,Undergraduate,Poland,6.2,Facebook,Yes,6.3,5,Single,4,8

In [79]:
d.describe()    #Gives the summary of dataset

,Student_ID,Age,Avg_Daily_Usage_Hours,Sleep_Hours_Per_Night,Mental_Health_Score,Conflicts_Over_Social_Media,Addicted_Score
count,705.000000,705.000000,705.000000,705.000000,705.000000,705.000000,705.000000
mean,353.000000,20.659574,4.918723,6.868936,6.226950,2.849645,6.436879
std,203.660256,1.399217,1.257395,1.126848,1.105055,0.957968,1.587165
min,1.000000,18.000000,1.500000,3.800000,4.000000,0.000000,2.000000
25%,177.000000,19.000000,4.100000,6.000000,5.000000,2.000000,5.000000
50%,353.000000,21.000000,4.800000,6.900000,6.000000,3.000000,7.000000
75%,529.000000,22.000000,5.800000,7.700000,7.000000,4.000000,8.000000
max,705.000000,24.000000,8.500000,9.600000,9.000000,5.000000,9.000000

In [80]:
d.describe(include="object")   #It extracts only object datatype columns

,Gender,Academic_Level,Country,Most_Used_Platform,Affects_Academic_Performance,Relationship_Status
count,705,705,705,705,705,705
unique,2,3,110,12,2,3
top,Female,Undergraduate,India,Instagram,Yes,Single
freq,353,353,53,249,453,384

In [81]:
d.info()   #We can find datatypes of columns here

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 705 entries, 0 to 704
Data columns (total 13 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Student_ID                    705 non-null    int64
 1   Age                           705 non-null    int64
 2   Gender                        705 non-null    object
 3   Academic_Level                705 non-null    object
 4   Country                       705 non-null    object
 5   Avg_Daily_Usage_Hours         705 non-null    float64
 6   Most_Used_Platform            705 non-null    object
 7   Affects_Academic_Performance  705 non-null    object
 8   Sleep_Hours_Per_Night         705 non-null    float64
 9   Mental_Health_Score           705 non-null    int64
 10  Relationship_Status           705 non-null    object
 11  Conflicts_Over_Social_Media   705 non-null    int64
 12  Addicted_Score                705 non-null    int64
dtypes: float64(2), int64(5), object(6)
memory usage: 71.7+ KB

In [82]:
d.describe(include="all")  #It extracts all columns

,Student_ID,Age,Gender,Academic_Level,Country,Avg_Daily_Usage_Hours,Most_Used_Platform,Affects_Academic_Performance,Sleep_Hours_Per_Night,Mental_Health_Score,Relationship_Status,Conflicts_Over_Social_Media,Addicted_Score
count,705.000000,705.000000,705,705,705,705.000000,705,705,705.000000,705.000000,705,705.000000,705.000000
unique,NaN,NaN,2,3,110,NaN,12,2,NaN,NaN,3,NaN,NaN
top,NaN,NaN,Female,Undergraduate,India,NaN,Instagram,Yes,NaN,NaN,Single,NaN,NaN
freq,NaN,NaN,353,353,53,NaN,249,453,NaN,NaN,384,NaN,NaN
mean,353.000000,20.659574,NaN,NaN,NaN,4.918723,NaN,NaN,6.868936,6.226950,NaN,2.849645,6.436879
std,203.660256,1.399217,NaN,NaN,NaN,1.257395,NaN,NaN,1.126848,1.105055,NaN,0.957968,1.587165
min,1.000000,18.000000,NaN,NaN,NaN,1.500000,NaN,NaN,3.800000,4.000000,NaN,0.000000,2.000000
25%,177.000000,19.000000,NaN,NaN,NaN,4.100000,NaN,NaN,6.000000,5.000000,NaN,2.000000,5.000000
50%,353.000000,21.000000,NaN,NaN,NaN,4.800000,NaN,NaN,6.900000,6.000000,NaN,3.000000,7.000000
75%,529.000000,22.000000,NaN,NaN,NaN,5.800000,NaN,NaN,7.700000,7.000000,NaN,4.000000,8.000000
max,705.000000,24.000000,NaN,NaN,NaN,8.500000,NaN,NaN,9.600000,9.000000,NaN,5.000000,9.000000

In [83]:
d['Age'].mean()  #Gives mean value of age column

20.659574468085108

In [84]:
d['Age'].max()

24

In [85]:
d['Age'].min()

18

In [86]:
d['Age'].median()

21.0

In [87]:
d['Age'].var()

1.9578094777562918

In [88]:
d['Age'].std()

1.399217451919569

In [89]:
d['Age'].count()   #Counts the number of rows

705

In [90]:
pd.read_csv('market.csv')

  vegetables   color    unit       min   max
0   beetroot  purple     1kg         15   40
1     carrot  orange     1kg         25   45
2     tomato     red     1kg         53   90
3   kovakkai   green     1kg         30   45
4    coconut   white  1piece  seventeen   38

**Merging and Joining**

In [91]:
market

  vegetables   color    unit    min  max
0   beetroot  purple     1kg     15   45
1     carrot  orange     1kg     25   50
2     tomato     red     1kg     53   95
3   kovakkai   green     1kg     30   50
4    coconut   white  1piece  False   43
5    Cabbage   green  1piece     10   35